#include <stdio.h>
int main()
{
    double pi = 0, a = -4;
    int n = 0, f = 0;
    while (1)
    {
        n++;
        a *= -1;
        pi += a / (2 * n - 1);
        if (f == 0 && pi - 3.14 < 0.01 && pi - 3.14 > 0 && pi - 3.141 >= 0.001)
        {
            printf("计算%d项后达到3.14\n", n);
            f++;
        }
        if (f == 1 && pi - 3.141 < 0.001 && pi - 3.1415 > 0 && pi - 3.1415 >= 0.0001)
        {
            printf("计算%d项后达到3.141\n", n);
            f++;
        }
        if (f == 2 && pi - 3.1415 < 0.0001 && pi - 3.1415 > 0 && pi - 3.1415 >= 0.00001)
        {
            printf("计算%d项后达到3.1415\n", n);
            f++;
        }
        if (f == 3 && pi - 3.1415 < 0.00001 && pi - 3.1415 > 0)
        {
            printf("计算%d项后达到3.14159", n);
            break;
        }
    }
    return 0;
}